{
  "movies": [
    {
      "id": 1,
      "title": "Looper",
      "year": "2012",
      "runtime": "119",
      "genres": [
        "Action",
        "Crime",
        "Drama"
      ],
      "director": "Rian Johnson",
      "actors": "Joseph Gordon-Levitt, Bruce Willis, Emily Blunt, Paul Dano",
      "plot": "In 2074, when the mob wants to get rid of someone, the target is sent into the past, where a hired gun awaits - someone like Joe - who one day learns the mob wants to 'close the loop' by sending back Joe's future self for assassination."
    },
    {
      "id": 2,
      "title": "Ratatouille",
      "year": "2007",
      "runtime": "111",
      "genres": [
        "Animation",
        "Comedy",
        "Family"
      ],
      "director": "Brad Bird, Jan Pinkava",
      "actors": "Patton Oswalt, Ian Holm, Lou Romano, Brian Dennehy",
      "plot": "A rat who can cook makes an unusual alliance with a young kitchen worker at a famous restaurant."
    },
    {
      "id": 3,
      "title": "Memento",
      "year": "2000",
      "runtime": "113",
      "genres": [
        "Mystery",
        "Thriller"
      ],
      "director": "Christopher Nolan",
      "actors": "Guy Pearce, Carrie-Anne Moss, Joe Pantoliano, Mark Boone Junior",
      "plot": "A man juggles searching for his wife's murderer and keeping his short-term memory loss from being an obstacle."
    },
    {
      "id": 4,
      "title": "The Shawshank Redemption",
      "year": "1994",
      "runtime": "142",
      "genres": [
        "Crime",
        "Drama"
      ],
      "director": "Frank Darabont",
      "actors": "Tim Robbins, Morgan Freeman, Bob Gunton, William Sadler",
      "plot": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency."
    },
    {
      "id": 5,
      "title": "City of God",
      "year": "2002",
      "runtime": "130",
      "genres": [
        "Crime",
        "Drama"
      ],
      "director": "Fernando Meirelles, Kátia Lund",
      "actors": "Alexandre Rodrigues, Leandro Firmino, Phellipe Haagensen, Douglas Silva",
      "plot": "Two boys growing up in a violent neighborhood of Rio de Janeiro take different paths: one becomes a photographer, the other a drug dealer."
    },
    {
      "id": 6,
      "title": "L.A. Confidential",
      "year": "1997",
      "runtime": "138",
      "genres": [
        "Crime",
        "Drama",
        "Mystery"
      ],
      "director": "Curtis Hanson",
      "actors": "Kevin Spacey, Russell Crowe, Guy Pearce, James Cromwell",
      "plot": "As corruption grows in 1950s LA, three policemen - one strait-laced, one brutal, and one sleazy - investigate a series of murders with their own brand of justice."
    },
    {
      "id": 7,
      "title": "Snatch",
      "year": "2000",
      "runtime": "102",
      "genres": [
        "Comedy",
        "Crime"
      ],
      "director": "Guy Ritchie",
      "actors": "Benicio Del Toro, Dennis Farina, Vinnie Jones, Brad Pitt",
      "plot": "Unscrupulous boxing promoters, violent bookmakers, a Russian gangster, incompetent amateur robbers, and supposedly Jewish jewelers fight to track down a priceless stolen diamond."
    },
    {
      "id": 8,
      "title": "Black Swan",
      "year": "2010",
      "runtime": "108",
      "genres": [
        "Drama",
        "Thriller"
      ],
      "director": "Darren Aronofsky",
      "actors": "Natalie Portman, Mila Kunis, Vincent Cassel, Barbara Hershey",
      "plot": "A committed dancer wins the lead role in a production of Tchaikovsky's \"Swan Lake\" only to find herself struggling to maintain her sanity."
    },
    {
      "id": 9,
      "title": "Pulp Fiction",
      "year": "1994",
      "runtime": "154",
      "genres": [
        "Crime",
        "Drama"
      ],
      "director": "Quentin Tarantino",
      "actors": "Tim Roth, Amanda Plummer, Laura Lovelace, John Travolta",
      "plot": "The lives of two mob hit men, a boxer, a gangster's wife, and a pair of diner bandits intertwine in four tales of violence and redemption."
    },
    {
      "id": 10,
      "title": "Lock, Stock and Two Smoking Barrels",
      "year": "1998",
      "runtime": "107",
      "genres": [
        "Comedy",
        "Crime"
      ],
      "director": "Guy Ritchie",
      "actors": "Jason Flemyng, Dexter Fletcher, Nick Moran, Jason Statham",
      "plot": "A botched card game in London triggers four friends, thugs, weed-growers, hard gangsters, loan sharks and debt collectors to collide with each other in a series of unexpected events, all for the sake of weed, cash and two antique shotguns."
    },
    {
      "id": 11,
      "title": "Pan's Labyrinth",
      "year": "2006",
      "runtime": "118",
      "genres": [
        "Drama",
        "Fantasy",
        "War"
      ],
      "director": "Guillermo del Toro",
      "actors": "Ivana Baquero, Sergi López, Maribel Verdú, Doug Jones",
      "plot": "In the falangist Spain of 1944, the bookish young stepdaughter of a sadistic army officer escapes into an eerie but captivating fantasy world."
    },
    {
      "id": 12,
      "title": "Moneyball",
      "year": "2011",
      "runtime": "133",
      "genres": [
        "Biography",
        "Drama",
        "Sport"
      ],
      "director": "Bennett Miller",
      "actors": "Brad Pitt, Jonah Hill, Philip Seymour Hoffman, Robin Wright",
      "plot": "Oakland A's general manager Billy Beane's successful attempt to assemble a baseball team on a lean budget by employing computer-generated analysis to acquire new players."
    },
    {
      "id": 13,
      "title": "Forrest Gump",
      "year": "1994",
      "runtime": "142",
      "genres": [
        "Comedy",
        "Drama"
      ],
      "director": "Robert Zemeckis",
      "actors": "Tom Hanks, Rebecca Williams, Sally Field, Michael Conner Humphreys",
      "plot": "Forrest Gump, while not intelligent, has accidentally been present at many historic moments, but his true love, Jenny Curran, eludes him."
    },
    {
      "id": 14,
      "title": "Vicky Cristina Barcelona",
      "year": "2008",
      "runtime": "96",
      "genres": [
        "Drama",
        "Romance"
      ],
      "director": "Woody Allen",
      "actors": "Rebecca Hall, Scarlett Johansson, Christopher Evan Welch, Chris Messina",
      "plot": "Two girlfriends on a summer holiday in Spain become enamored with the same painter, unaware that his ex-wife, with whom he has a tempestuous relationship, is about to re-enter the picture."
    },
    {
      "id": 15,
      "title": "Madagascar",
      "year": "2005",
      "runtime": "86",
      "genres": [
        "Animation",
        "Adventure",
        "Comedy"
      ],
      "director": "Eric Darnell, Tom McGrath",
      "actors": "Ben Stiller, Chris Rock, David Schwimmer, Jada Pinkett Smith",
      "plot": "Spoiled by their upbringing with no idea what wild life is really like, four animals from New York Central Zoo escape, unwittingly assisted by four absconding penguins, and find themselves in Madagascar, among a bunch of merry lemurs"
    },
    {
      "id": 16,
      "title": "Psycho",
      "year": "1960",
      "runtime": "109",
      "genres": [
        "Horror",
        "Mystery",
        "Thriller"
      ],
      "director": "Alfred Hitchcock",
      "actors": "Anthony Perkins, Vera Miles, John Gavin, Janet Leigh",
      "plot": "A Phoenix secretary embezzles $40,000 from her employer's client, goes on the run, and checks into a remote motel run by a young man under the domination of his mother."
    },
    {
      "id": 17,
      "title": "Ice Age",
      "year": "2002",
      "runtime": "81",
      "genres": [
        "Animation",
        "Adventure",
        "Comedy"
      ],
      "director": "Chris Wedge, Carlos Saldanha",
      "actors": "Ray Romano, John Leguizamo, Denis Leary, Goran Visnjic",
      "plot": "Set during the Ice Age, a sabertooth tiger, a sloth, and a wooly mammoth find a lost human infant, and they try to return him to his tribe."
    },
    {
      "id": 18,
      "title": "Ice Age",
      "year": "2002",
      "runtime": "81",
      "genres": [
        "Animation",
        "Adventure",
        "Comedy"
      ],
      "director": "Chris Wedge, Carlos Saldanha",
      "actors": "Ray Romano, John Leguizamo, Denis Leary, Goran Visnjic",
      "plot": "Set during the Ice Age, a sabertooth tiger, a sloth, and a wooly mammoth find a lost human infant, and they try to return him to his tribe."
    }
  ]
}
